history = [
    // 第一回合

    [{
            player: '合纵',
            fun: '明出',
            card: '合纵-齐',
        },
        {
            player: '连横',
            fun: '暗出',
            card: '联合齐',
            act: {
                fun: '外交',
                country: '赵'
            }
        },
        {
            player: '合纵',
            fun: '明出',
            card: '公孙衍',
            act: {
                country: '韩'
            }
        },
        {
            player: '连横',
            fun: '暗出',
            card: '联合楚',
            act: {
                fun: '外交',
                country: '燕'
            }
        },
        {
            player: '合纵',
            fun: '明出',
            card: '名将',
            act: {
                people: '项燕',
                map: '南郡'
            }
        },
        {
            player: '连横',
            fun: '明出',
            card: '范雎',
            act: {
                people: '项燕'
            }
        },
        {
            player: '合纵',
            fun: '明出',
            card: '名将',
            act: {
                people: '项燕',
                map: '南郡'
            }
        },
        {
            player: '连横',
            fun: '明出',
            card: '名将',
            act: {
                people: '白起',
                map: '汉中'
            }
        },
        // {player:'合纵',fun:'明出',card:'合纵楚',act:{map:'增援泗水','2人进攻宋',res:[6,2]}},
        {
            player: '连横',
            fun: '明出',
            card: '紧急动员',
            act: {
                from: '汉中',
                arm: ['白起', '兵', '兵', '兵'],
                map: '南阳',
                res: [3, 2]
            }
        },

        {
            player: '连横',
            fun: '暗出',
            card: '韩非',
            act: {
                fun: '外交',
                country: '魏'
            }
        }
    ],
    // 第二回合
    [{
            player: '连横',
            fun: '明出',
            card: '举国',
            act: {
                map: ['上郡', '内使']
            }
        },
        {
            player: '合纵',
            fun: '明出',
            card: '合纵赵',
            act: {
                choice: 2
            }
        },
        {
            player: '连横',
            fun: '暗出',
            card: '名将',
            act: {
                fun: '外交',
                country: '齐'
            }
        },
        {
            player: '合纵',
            fun: '暗出',
            card: '名将',
            act: {
                fun: '增兵',
                map: '泗水'
            }
        },
        {
            player: '连横',
            fun: '明出',
            card: '箭雨',
            act: {
                from: '巴蜀',
                arm: ['司马错', '兵', '兵', '兵'],
                map: '南郡',
                res: ["连横,6", "合纵,3"]
            }
        },
        {
            player: '合纵',
            fun: '暗出',
            card: '合纵齐',
            act: {
                fun: '增兵',
                map: '南郡'
            }
        },
        {
            player: '连横',
            fun: '明出',
            card: '兵分两路',
            act: {
                fun: [{
                        from: '汉中',
                        arm: ['兵'],
                        map: '南阳'
                    },
                    {
                        from: '内史',
                        arm: ['兵'],
                        map: '南阳'
                    }
                ]
            }
        },
        {
            player: '合纵',
            fun: '暗出',
            card: '名将',
            act: {
                fun: '增兵',
                map: '南阳'
            }
        },
        {
            player: '连横',
            fun: '明出',
            card: '紧急',
            act: {
                from: '南阳' + 1, //有问题
                arm: ['白起', '兵', '兵', '兵'],
                map: '泗水',
                res: {
                    "连横": 4,
                    "合纵": 2
                }
            }
        },
        {
            player: '合纵',
            fun: '明出',
            card: '毛遂',
            act: {
                country: '魏',
                arm: ['兵', '兵', '兵', '兵'],
                from: '韩',
                map: '南阳',
                res: {
                    "合纵": 2,
                    "连横": 5
                }
            }
        },
        {
            player: '合纵',
            fun: '明出',
            card: '箭雨',
            act: {
                arm: ['项燕', '兵'],
                map: '南阳',
                res: {
                    "合纵": 2,
                    "连横": 2
                }
            },
        }
    ],
    // 第三回合
    [`
        魏威:
        公孙衍，齐，2
        
        刘振亚:
        魏韩燕，魏
        
        魏威:
        合纵齐，琅琊+1,4兵攻泗水
        
        魏威:
        6
        
        刘振亚:
       5
        
        刘振亚:
        举国，泗水，汉中
        
      
        
        魏威:
        郭鬼，暗出，南郡加1
        
        刘振亚:
        紧急动员，巴蜀，司马错+3兵，南郡
        
        刘振亚:
        4
        
        魏威:
        6
        
        魏威:
        毛遂，赵1，太原4兵攻上郡
        
        魏威:
        2
        
        刘振亚:
        4
        
        刘振亚:
        紧急，泗水+1，河东1兵to巴蜀
        
        魏威:
        苏秦，赵1，燕1
        
        刘振亚:
        剑雨，泗水白起+2兵，南阳
        
        刘振亚:
        4
        
        魏威:
        名将，廉颇，邯郸
        `



    ],
    // 第四回合
    [
        `
        刘振亚:
        why，燕
        
        魏威:
        箭雨，廉颇加3兵，攻河东
        
        魏威:
        2
        
        刘振亚:
        紧急，南阳+1，1兵邯郸
        
        魏威:
        暗出，春申君，东郡2兵攻邯郸
        
        魏威:
        4
        
        刘振亚:
        3
        
        刘振亚:
        举国，内史，上郡
        魏威:
        名将，赵奢，太原
        
        刘振亚:
        why，魏2兵，邯郸
        
        刘振亚:
        1
        
        魏威:
        5
        魏威:
        名将，暗出，赵奢➕3兵攻上郡

        魏威:
        4

        刘振亚:
        3

        刘振亚:
        张仪，赵

        魏威:
        鼓舞士气，暗出，淮夷2齐兵入泗水
        
        刘振亚:
        过

        公孙衍，魏2

 
 
 
        `
    ],

    // 第五回合
    [
        `魏威:
        合纵赵，上郡➕1，赵奢➕3兵攻内史

        魏威:
        [动画表情]

        刘振亚:
        [动画表情]

        刘振亚:
        张仪，赵

        魏威:
        毛遂，魏1，3魏攻南阳
        
        魏威:
        1
        
        刘振亚:
       5
        
        刘振亚:
        why，韩
        
        魏威:
        联合，泗水➕1,魏➕1
        
        刘振亚:
        举国，陇西，巴蜀
        
        苏秦，韩

        名将，王翦，汉中

        魏威:
        合纵楚，宋➕1，宋2兵至豫章
        
        刘振亚:
        兵分两路，陇西1to上郡，汉中王翦1兵太原
        
        郭鬼，暗出，邯郸➕1

        `
    ],

    // 第六回合
    [`
    刘振亚:
    why，韩

    魏威:
    合纵赵，赵2

    刘振亚:
    张仪，赵

    魏威:
    联合，邯郸➕1，豫章➕1

    刘振亚:
    韩非

    魏威:
    名将，田单，泗水

    刘振亚:
    紧急，太原+1，巴蜀1to南阳

    魏威:
    孟尝君，选1牌

    刘振亚:
    李斯

    刘振亚:
    暗出，齐，南阳+1

    魏威:
    箭雨，豫章，4兵攻南郡

    魏威:
    4

    刘振亚:
    5

    刘振亚:
    暗出，名将，南郡+1

    
    魏威:
    why燕2

    
    `

    ],


    // 第七回合
    [
        `
        魏威:
        合纵赵2

        刘振亚:
        范雎，廉颇

        魏威:
        名将，廉颇，河东

        刘振亚:
        韩非

        魏威:
        why，燕

        刘振亚:
        秦王，张仪

        魏威:
        郭鬼，抓2

        刘振亚:
        张仪，赵

        魏威:
        荆轲

        魏威:
公孙衍，韩2

刘振亚:
紧急，太原all to内史

刘振亚:4

魏威:6

魏威:
名将，暗出，河东all内史

魏威:3

刘振亚:2

刘振亚:
紧急，南郡+1，南阳白起+3兵，魏

刘振亚:3

魏威:5

魏威:
过

刘振亚:
暗出，齐，魏+1

刘振亚:
鼓舞，白起+1兵，宋

刘振亚:1

魏威:1
魏威:
孟尝君，抓牌

魏威:
箭雨，田单➕3攻魏

魏威:2

刘振亚:4

        
        
        
        
        `
    ],


]